<a href="https://colab.research.google.com/github/royarkaofficial/DataOps-SqlLite3-7th-Jan-Data-testing/blob/main/Another_copy_of_Lab_SQLite3_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Problem Statement:
Title: Demonstrating Python-SQLite3 Integration for Database Operations

Objective:

Design and implement a Python program that establishes a connection with a SQLite database, creates a table, performs various SQL operations (INSERT, SELECT, UPDATE, DELETE, ALTER, DROP), and displays the results of each operation. This program aims to serve as a lab exercise for Participants learning database operations and their integration with Python.

Problem Description:

Develop a Python program that simulates a basic student database system for a lab demonstration. The program should:

Establish a connection with a SQLite database.
Create a table named students with the following fields:

id: A unique identifier for each student (Primary Key).

name: The student's name (Text, Not Null).

age: The student's age (Integer).

grade: The student's grade (Text).

1. Insert sample student data into the table using the INSERT command.
2. Query the table using the SELECT command to retrieve and display all rows.
3. Update a student's grade using the UPDATE command.
4. Delete a student's record based on their name using the DELETE command.
5. Alter the table to add a new column (email) using the ALTER TABLE command.
7. Drop the table using the DROP TABLE command.
8. Close the database connection.

In [ ]:
import sqlite3

In [ ]:
#connect and create a database
connection = sqlite3.connect('student.db')

In [ ]:
cursor = connection.cursor()

In [ ]:
#create a table
q1 = """
CREATE TABLE IF NOT EXISTS students(
id INTEGER PRIMARY KEY,
name TEXT NOT NULL,
age INTEGER,
grade TEXT
)
"""
cursor.execute(q1)
print("Students table is created")

Students table is created

In [ ]:
#insert the values in the table
data = [[101,"Kiran", 16, "C"], [102, "Anil", 16, "A"], [103, "Sujith", 16, "B"]]
q2 = "INSERT INTO students VALUES(?, ?, ?, ?)"
cursor.executemany(q2, data)
connection.commit()
print("Data is inserted")

Data is inserted

In [ ]:
#display all the data in the tale
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(101, 'Kiran', 16, 'C')
(102, 'Anil', 16, 'A')
(103, 'Sujith', 16, 'B')

In [ ]:
#Update a student's grade using the UPDATE command
q4 = "UPDATE students SET name = 'nikhil' WHERE id = 101"
cursor.execute(q4)
connection.commit()
print("Data is updated")

Data is updated

In [ ]:
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(101, 'nikhil', 16, 'C')
(102, 'Anil', 16, 'A')
(103, 'Sujith', 16, 'B')

In [ ]:
#Delete a student's record based on their name using the DELETE command.
q5 = "DELETE FROM students WHERE id = 101"
cursor.execute(q5)
connection.commit()
print("Data is deleted")

Data is deleted

In [ ]:
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(102, 'Anil', 16, 'A')
(103, 'Sujith', 16, 'B')

In [ ]:
#Alter the table to add a new column (email) using the ALTER TABLE command.
q6 = "ALTER TABLE students ADD COLUMN email TEXT"
cursor.execute(q6)
connection.commit()
print("New column is added")

New column is added

In [ ]:
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(102, 'Anil', 16, 'A', None)
(103, 'Sujith', 16, 'B', None)

In [ ]:
cursor.execute("UPDATE students SET email = 'shravani@gmail.com' WHERE id = 102")
cursor.execute("UPDATE students SET email = 'soumya@gmail.com' WHERE id = 103")
connection.commit()

In [ ]:
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(102, 'Anil', 16, 'A', 'shravani@gmail.com')
(103, 'Sujith', 16, 'B', 'soumya@gmail.com')

In [ ]:
#Drop the table using the DROP TABLE command
q7 = "DROP TABLE students"
cursor.execute(q7)
connection.commit()
print("Table is dropped")

Table is dropped

In [ ]:
q3 =  "SELECT * FROM students"
cursor.execute(q3)
data = cursor.fetchall()
for row in data:
    print(row)

(101, 'Kiran', 16, 'C')
(102, 'Anil', 16, 'A')
(103, 'Sujith', 16, 'B')

In [ ]:
#Close the database connection.
connection.close()

Checking the metadata of the database

In [ ]:
#connect and create a database
connection = sqlite3.connect('student.db')

cursor = connection.cursor()

#create a table
q1 = """
CREATE TABLE IF NOT EXISTS students(
id INTEGER PRIMARY KEY,
name TEXT NOT NULL,
age INTEGER,
grade TEXT
)
"""
cursor.execute(q1)
print("Students table is created")

#insert the vaues in the table
data = [[101,"Kiran", 16, "C"], [102, "Anil", 16, "A"], [103, "Sujith", 16, "B"]]
q2 = "INSERT INTO students VALUES(?, ?, ?, ?)"
cursor.executemany(q2, data)
connection.commit()
print("Data is inserted")

Students table is created
Data is inserted

In [ ]:
q8 = "SELECT name FROM sqlite_master WHERE type = 'table'"
cursor.execute(q8)
data = cursor.fetchall()
for row in data:
    print(row)

('students',)

In [ ]:
#extract informantion about the students table
q9 = "PRAGMA table_info(students)"
cursor.execute(q9)
data = cursor.fetchall()
for row in data:
    print(row)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'name', 'TEXT', 1, None, 0)
(2, 'age', 'INTEGER', 0, None, 0)
(3, 'grade', 'TEXT', 0, None, 0)

In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.1.0-cp310-cp310-manylinux_2_28_x86_64.whl.metadata (6.0 kB)
Downloading mysql_connector_python-9.1.0-cp310-cp310-manylinux_2_28_x86_64.whl (34.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.4/34.4 MB 33.0 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.1.0

In [3]:
import sqlite3

# Connect to SQLite (or create a new database if not existing)
conn = sqlite3.connect('sample_database.db')
cursor = conn.cursor()

# Create a sample table (if not exists) and insert data
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT,
    salaryw REAL
)
''')

# Insert some sample data
cursor.executemany('''
INSERT INTO employees (name, department, salaryw)
VALUES (?, ?, ?)
''', [
    ('Alice', 'HR', 70000),
    ('Bob', 'Engineering', 95000),
    ('Charlie', 'Marketing', 60000)
])

conn.commit()  # Save changes

In [4]:
# Query data
cursor.execute("SELECT * FROM employees")

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Print each row
for row in rows:
    print(row)

# Close the connection
conn.close()

(1, 'Alice', 'HR', 70000.0)
(2, 'Bob', 'Engineering', 95000.0)
(3, 'Charlie', 'Marketing', 60000.0)